cases/dafoam/probes/curriculum_D11_mrf_probe_Oprime/d11o_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale   1.0;

vertices
(
    (0.00 0.00 0.000)
    (0.20 0.00 0.000)
    (0.20 0.02 0.000)
    (0.00 0.02 0.000)
    (0.00 0.00 0.002)
    (0.20 0.00 0.002)
    (0.20 0.02 0.002)
    (0.00 0.02 0.002)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    lowerWall
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    upperWall
    {
        type wall;
        faces ( (3 7 6 2) );
    }
    frontAndBack
    {
        type symmetry;
        faces ( (0 3 2 1) (4 5 6 7) );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
