cases/dafoam/probes/curriculum_D11_mrf_probe_Oprime/d11o_case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel Newtonian;
nu  1.5e-05;
Pr  0.7;
Prt 1.0;
Cp  1004;
// ************************************************************************* //
