cases/dafoam/probes/curriculum_D11_mrf_probe_Oprime/d11o_case/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet        { type zeroGradient; }
    outlet       { type fixedValue; value uniform 0; }
    upperWall    { type zeroGradient; }
    lowerWall    { type zeroGradient; }
    frontAndBack { type symmetry; }
}
